articles/emacs/keybindings.org
# Created 2021-10-08 Fri 09:18
#+OPTIONS: H:8
#+TITLE: Keybindings
#+AUTHOR: Aviral Goel

* Moving

#+caption: Commands for moving the cursor
| Keybinding | Command               | Description                  |
|------------+-----------------------+------------------------------|
| =C-b=      | =backward-char=       | Move backward by a character |
| =C-f=      | =forward-char=        | Move forward by a character  |
| =M-b=      | =backward-word=       | Move backward by a word      |
| =M-f=      | =forward-word=        | Move forward by a word       |
| =M-a=      | =backward-sentence=   | Move backward by a sentence  |
| =M-e=      | =forward-sentence=    | Move forward by a sentence   |
| =M-{=      | =backward-paragraph=  | Move backward by a paragraph |
| =M-}=      | =forward-paragraph=   | Move forward by a paragraph  |
| =C-p=      | =previous-line=       | Move to previous line        |
| =C-n=      | =next-line=           | Move to next line            |
| =C-a=      | =beginning-of-line=   | Move to beginning of line    |
| =C-e=      | =end-of-line=         | Move to end of line          |
| =M-<=      | =beginning-of-buffer= | Move to beginning of buffer  |
| =M->=      | =end-of-buffer=       | Move to end of buffer        |

* Scrolling

#+caption: Commands for scrolling
| Keybinding | Command               | Description                    |
|------------+-----------------------+--------------------------------|
| =C-v=      | =scroll-up-command=   | Scroll down one screenful      |
| =M-v=      | =scroll-down-command= | Scroll up one screenful        |
| =C-x <=    | =scroll-left=         | Scroll left by window width    |
| =C-x >=    | =scroll-right=        | Scroll right by window width   |
| =M-C-v=    | =scroll-other-window= | Scroll down in the next window |
| =C-l=      | =recenter-top-bottom= | Scroll to center current line  |

* Jumping

#+caption: Commands for Jumping
| Keybinding | Command          | Description    |
|------------+------------------+----------------|
| =M-g g=    | =go-to-line=     | Jump to line   |
| =M-g TAB=  | =move-to-column= | Jump to column |

* Mark and Point

#+caption: Commands for Jumping
| Keybinding | Command                    | Description                                         |
|------------+----------------------------+-----------------------------------------------------|
| =C-@=      | =set-mark-command=         | Set mark at point                                   |
| =C-x C-x=  | =exchange-point-and-mark=  | Interchange mark and point                          |
| =M-@=      | =mark-word=                | Set mark after next word                            |
| =M-h=      | =mark-paragraph=           | Put region around paragraph                         |
| =C-x C-p=  | =mark-page=                | Put region around page                              |
| =C-x h=    | =mark-whole-buffer=        | Put region around buffer                            |
| =C-M-@=    | =mark-sexp=                | Set mark after end of following balanced expression |
|            | =mark-beginning-of-buffer= | Set mark at beginning of buffer                     |
|            | =mark-end-of-buffer=       | Set mark at end of buffer                           |
