articles/emacs/keybindings.org.html
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN">
<!-- Created by htmlize-1.56 in css mode. -->
<html>
  <head>
    <title>keybindings.org</title>
  </head>
  <body>
    <pre>
<span class="org-meta-line">#+OPTIONS: H:8</span>
<span class="org-document-info-keyword">#+AUTHOR:</span> <span class="org-document-info">Aviral Goel
</span><span class="org-document-info-keyword">#+TITLE:</span> <span class="org-document-title">Keybindings
</span>
<span class="org-level-1"><span class="org-superstar-header-bullet">*</span></span><span class="org-level-1"> Moving</span>

<span class="org-meta-line">#+CAPTION:</span> <span class="org-block">Commands for moving the cursor</span>
<span class="org-table">| Keybinding | Command               | Description                  |</span>
<span class="org-table">|------------+-----------------------+------------------------------|</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=C-b=</span></span><span class="org-table">      | </span><span class="org-formula"><span class="org-verbatim">=backward-char=</span></span><span class="org-formula">       </span><span class="org-table">| Move backward by a character |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=C-f=</span></span><span class="org-table">      | </span><span class="org-formula"><span class="org-verbatim">=forward-char=</span></span><span class="org-formula">        </span><span class="org-table">| Move forward by a character  |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=M-b=</span></span><span class="org-table">      | </span><span class="org-formula"><span class="org-verbatim">=backward-word=</span></span><span class="org-formula">       </span><span class="org-table">| Move backward by a word      |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=M-f=</span></span><span class="org-table">      | </span><span class="org-formula"><span class="org-verbatim">=forward-word=</span></span><span class="org-formula">        </span><span class="org-table">| Move forward by a word       |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=M-a=</span></span><span class="org-table">      | </span><span class="org-formula"><span class="org-verbatim">=backward-sentence=</span></span><span class="org-formula">   </span><span class="org-table">| Move backward by a sentence  |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=M-e=</span></span><span class="org-table">      | </span><span class="org-formula"><span class="org-verbatim">=forward-sentence=</span></span><span class="org-formula">    </span><span class="org-table">| Move forward by a sentence   |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=M-{=</span></span><span class="org-table">      | </span><span class="org-formula"><span class="org-verbatim">=backward-paragraph=</span></span><span class="org-formula">  </span><span class="org-table">| Move backward by a paragraph |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=M-}=</span></span><span class="org-table">      | </span><span class="org-formula"><span class="org-verbatim">=forward-paragraph=</span></span><span class="org-formula">   </span><span class="org-table">| Move forward by a paragraph  |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=C-p=</span></span><span class="org-table">      | </span><span class="org-formula"><span class="org-verbatim">=previous-line=</span></span><span class="org-formula">       </span><span class="org-table">| Move to previous line        |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=C-n=</span></span><span class="org-table">      | </span><span class="org-formula"><span class="org-verbatim">=next-line=</span></span><span class="org-formula">           </span><span class="org-table">| Move to next line            |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=C-a=</span></span><span class="org-table">      | </span><span class="org-formula"><span class="org-verbatim">=beginning-of-line=</span></span><span class="org-formula">   </span><span class="org-table">| Move to beginning of line    |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=C-e=</span></span><span class="org-table">      | </span><span class="org-formula"><span class="org-verbatim">=end-of-line=</span></span><span class="org-formula">         </span><span class="org-table">| Move to end of line          |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=M-&lt;=</span></span><span class="org-table">      | </span><span class="org-formula"><span class="org-verbatim">=beginning-of-buffer=</span></span><span class="org-formula"> </span><span class="org-table">| Move to beginning of buffer  |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=M-&gt;=</span></span><span class="org-table">      | </span><span class="org-formula"><span class="org-verbatim">=end-of-buffer=</span></span><span class="org-formula">       </span><span class="org-table">| Move to end of buffer        |</span>

<span class="org-level-1"><span class="org-superstar-header-bullet">*</span></span><span class="org-level-1"> Scrolling</span>
  
<span class="org-meta-line">#+CAPTION:</span> <span class="org-block">Commands for scrolling</span>
<span class="org-table">| Keybinding | Command               | Description                    |</span>
<span class="org-table">|------------+-----------------------+--------------------------------|</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=C-v=</span></span><span class="org-table">      | </span><span class="org-formula"><span class="org-verbatim">=scroll-up-command=</span></span><span class="org-formula">   </span><span class="org-table">| Scroll down one screenful      |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=M-v=</span></span><span class="org-table">      | </span><span class="org-formula"><span class="org-verbatim">=scroll-down-command=</span></span><span class="org-formula"> </span><span class="org-table">| Scroll up one screenful        |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=C-x &lt;=</span></span><span class="org-table">    | </span><span class="org-formula"><span class="org-verbatim">=scroll-left=</span></span><span class="org-formula">         </span><span class="org-table">| Scroll left by window width    |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=C-x &gt;=</span></span><span class="org-table">    | </span><span class="org-formula"><span class="org-verbatim">=scroll-right=</span></span><span class="org-formula">        </span><span class="org-table">| Scroll right by window width   |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=M-C-v=</span></span><span class="org-table">    | </span><span class="org-formula"><span class="org-verbatim">=scroll-other-window=</span></span><span class="org-formula"> </span><span class="org-table">| Scroll down in the next window |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=C-l=</span></span><span class="org-table">      | </span><span class="org-formula"><span class="org-verbatim">=recenter-top-bottom=</span></span><span class="org-formula"> </span><span class="org-table">| Scroll to center current line  |</span>

<span class="org-level-1"><span class="org-superstar-header-bullet">*</span></span><span class="org-level-1"> Jumping</span>

<span class="org-meta-line">#+CAPTION:</span> <span class="org-block">Commands for Jumping</span>
<span class="org-table">| Keybinding | Command          | Description    |</span>
<span class="org-table">|------------+------------------+----------------|</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=M-g g=</span></span><span class="org-table">    | </span><span class="org-formula"><span class="org-verbatim">=go-to-line=</span></span><span class="org-formula">     </span><span class="org-table">| Jump to line   |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=M-g TAB=</span></span><span class="org-table">  | </span><span class="org-formula"><span class="org-verbatim">=move-to-column=</span></span><span class="org-formula"> </span><span class="org-table">| Jump to column |</span>

<span class="org-level-1"><span class="org-superstar-header-bullet">*</span></span><span class="org-level-1"> Mark and Point</span>

<span class="org-meta-line">#+CAPTION:</span> <span class="org-block">Commands for Jumping</span>
<span class="org-table">| Keybinding | Command                    | Description                                         |</span>
<span class="org-table">|------------+----------------------------+-----------------------------------------------------|</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=C-@=</span></span><span class="org-table">      | </span><span class="org-formula"><span class="org-verbatim">=set-mark-command=</span></span><span class="org-formula">         </span><span class="org-table">| Set mark at point                                   |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=C-x C-x=</span></span><span class="org-table">  | </span><span class="org-formula"><span class="org-verbatim">=exchange-point-and-mark=</span></span><span class="org-formula">  </span><span class="org-table">| Interchange mark and point                          |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=M-@=</span></span><span class="org-table">      | </span><span class="org-formula"><span class="org-verbatim">=mark-word=</span></span><span class="org-formula">                </span><span class="org-table">| Set mark after next word                            |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=M-h=</span></span><span class="org-table">      | </span><span class="org-formula"><span class="org-verbatim">=mark-paragraph=</span></span><span class="org-formula">           </span><span class="org-table">| Put region around paragraph                         |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=C-x C-p=</span></span><span class="org-table">  | </span><span class="org-formula"><span class="org-verbatim">=mark-page=</span></span><span class="org-formula">                </span><span class="org-table">| Put region around page                              |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=C-x h=</span></span><span class="org-table">    | </span><span class="org-formula"><span class="org-verbatim">=mark-whole-buffer=</span></span><span class="org-formula">        </span><span class="org-table">| Put region around buffer                            |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=C-M-@=</span></span><span class="org-table">    | </span><span class="org-formula"><span class="org-verbatim">=mark-sexp=</span></span><span class="org-formula">                </span><span class="org-table">| Set mark after end of following balanced expression |</span>
<span class="org-table">|            | </span><span class="org-formula"><span class="org-verbatim">=mark-beginning-of-buffer=</span></span><span class="org-formula"> </span><span class="org-table">| Set mark at beginning of buffer                     |</span>
<span class="org-table">|            | </span><span class="org-formula"><span class="org-verbatim">=mark-end-of-buffer=</span></span><span class="org-formula">       </span><span class="org-table">| Set mark at end of buffer                           |</span>


</pre>
  </body>
</html>
